<template>
    <div style="filter: blur(7px);">
        <v-card :class="{ 'mr-4': !smAndDown }">
            <v-card-text>
                <template v-if="smAndDown">
                    <h2 class="text-center">
                        לורם איפסום דולור סיט אמט
                    </h2>
                </template>
                <template v-else>
                    <h1 class="text-center" style="line-height: 1.1">
                        לורם איפסום דולור סיט אמט
                    </h1>
                </template>
            </v-card-text>
            <v-divider></v-divider>
            <v-card-text class="text-center">
                <v-icon>
                    mdi-calendar-clock
                </v-icon>
                לורם
                |
                <v-icon> mdi-account</v-icon>
                איפסום
                |
                <v-icon>
                    mdi-newspaper-variant-outline
                </v-icon>
                דולור
            </v-card-text>
            <v-card-text class="mr-3">
                <p class="text-body-1 article-content">
                    לורם איפסום או בקיצור ליפסום, הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס,
                    ההדפסה
                    והפרסום.
                    <br>
                    למשל: לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי
                    ומרגשח.
                    <br>
                    עמחליף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה
                    ברורק. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר מונפרר סוברט לורם שבצק יהולל.
                    <br>
                    הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. המדובר במלל ארוך במיוחד שניתן לבדוק עמו
                    גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגדלי גופן והתאמתם למוצר הסופי.
                    <br>
                    בשל הדמיון של המילים בלורם איפסום ללטינית קלאסית, רבים חושבים שיש משמעות לטקסט, אולם לא נועדה להיות
                    לו
                    כל משמעות. המטרה היא רק "תפיסת מקום" על ידי מלל חסר משמעות. כדוגמת זה שמופיע לפניכם.
                    <v-divider></v-divider>
                    לורם איפסום או בקיצור ליפסום, הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס,
                    ההדפסה
                    והפרסום.
                    <br>
                    למשל: לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי
                    ומרגשח.
                    <br>
                    עמחליף לפרומי בלוף קינץ תתיח לרעח. לת צשחמי צש בליא, מנסוטו צמלח לביקו ננבי, צמוקו בלוקריה שיצמה
                    ברורק. להאמית קרהשק סכעיט דז מא, מנכם למטכין נשואי מנורךגולר מונפרר סוברט לורם שבצק יהולל.
                    <br>
                    הטקסט משמש כלי לייצוג דפוס שאמור להתווסף למוצר הפרסום בעתיד. המדובר במלל ארוך במיוחד שניתן לבדוק עמו
                    גופנים, וכן התאמת המלל לעמודים המעוצבים ובדיקת סוגי וגדלי גופן והתאמתם למוצר הסופי.
                    <br>
                    בשל הדמיון של המילים בלורם איפסום ללטינית קלאסית, רבים חושבים שיש משמעות לטקסט, אולם לא נועדה להיות
                    לו
                    כל משמעות. המטרה היא רק "תפיסת מקום" על ידי מלל חסר משמעות. כדוגמת זה שמופיע לפניכם.
                    <v-divider></v-divider>
                    לורם איפסום או בקיצור ליפסום, הוא מלל מקובל וחסר משמעות המשמש "ממלא מקום" בעת עריכה, בתחום הדפוס,
                    ההדפסה
                    והפרסום.
                    <br>
                    למשל: לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולורס מונפרד אדנדום סילקוף, מרגשי
                    ומרגשח.
                </p>
            </v-card-text>
        </v-card>
    </div>
</template>

<script setup>
import { useDisplay } from 'vuetify'

const { smAndDown } = useDisplay()
</script>